In [1]:
import pandas as pd

In [13]:
df = pd.DataFrame ({"State" : ["TN" ,"AP", "AP", "TN", "TN","TN","AP"] , "Dis": ["Che" ,"Vij","Hyd", "Che","Cmb","Cmb","Hyd"],
"Pop": [100000,200000,300000,230000,150000,270000,300000]} )
df

  State  Dis     Pop
0    TN  Che  100000
1    AP  Vij  200000
2    AP  Hyd  300000
3    TN  Che  230000
4    TN  Cmb  150000
5    TN  Cmb  270000
6    AP  Hyd  300000

In [14]:
pd.pivot_table(df, index =["State" ,"Dis"] , aggfunc= "mean")

              Pop
State Dis
AP    Hyd  300000
      Vij  200000
TN    Che  165000
      Cmb  210000

In [15]:
pd.pivot_table(df, index =["State"] , aggfunc= "sum")

          Pop
State
AP     800000
TN     750000

### Groupby()

In [16]:
d1=df.groupby(["State"]).sum()
d1

          Pop
State
AP     800000
TN     750000

In [17]:
df.groupby( [ "State" ,"Dis"]) .count()

           Pop
State Dis
AP    Hyd    2
      Vij    1
TN    Che    2
      Cmb    2

https://stackoverflow.com/questions/34702815/pandas-group-by-and-pivot-table-difference

In [21]:
df = pd.DataFrame ({"Fruit" : [ "Apple","Grapes","Apple","Grapes","Gauva", "Gauva","Berry","Berry"],
"Color" : ["Red","Green","Green", "Black","Green","Red","Black","Red"],
"Cost" : [50,70,80,50,65,70,80,90]})
df

    Fruit  Color  Cost
0   Apple    Red    50
1  Grapes  Green    70
2   Apple  Green    80
3  Grapes  Black    50
4   Gauva  Green    65
5   Gauva    Red    70
6   Berry  Black    80
7   Berry    Red    90

##### 1. Avg of Fruits by pivot and group by

In [22]:
pd.pivot_table(df, index="Fruit", aggfunc="mean")

        Cost
Fruit
Apple   65.0
Berry   85.0
Gauva   67.5
Grapes  60.0

In [23]:
df.groupby(["Fruit"]).mean()

        Cost
Fruit
Apple   65.0
Berry   85.0
Gauva   67.5
Grapes  60.0

##### 2. Avg of Fruits by pivot and group by

In [24]:
pd.pivot_table(df, index="Color", aggfunc="mean")

            Cost
Color
Black  65.000000
Green  71.666667
Red    70.000000

In [28]:
df.groupby(["Color"]).mean()

            Cost
Color
Black  65.000000
Green  71.666667
Red    70.000000

##### 3.1. Avg of Fruits and color by pivot and group by

In [29]:
pd.pivot_table(df, index="Color", aggfunc="mean")

            Cost
Color
Black  65.000000
Green  71.666667
Red    70.000000

In [31]:
df.groupby(["Color","Fruit"]).mean()

              Cost
Color Fruit
Black Berry     80
      Grapes    50
Green Apple     80
      Gauva     65
      Grapes    70
Red   Apple     50
      Berry     90
      Gauva     70

In [ ]:
pd.pivot_table()